backend/app/controllers/seances_controller.rb

INSERT INTO "seances" ("user_id", "name", "exercice", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["user_id", 1], ["name", "test3"], ["exercice", "{}"], ["created_at", "2024-02-13 14:01:35.386379"], ["updated_at", "2024-02-13 14:01:35.386379"]]
---
  def create
     @seance = @current_user.seances.new(seance_params)
     if @seance.save!